; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v9 ?v12)
             (pred_3 ?v13 ?v1)
             (pred_7 ?v9 ?v1)
             (pred_10 ?v6 ?v9 )
	     (pred_12 ?v9)
             (pred_8 ?v10)
             (pred_11 ?v13)
             (pred_2 ?v1)
             (pred_1 ?v9)
             (pred_6 ?v13)
             (pred_9 ?v9)
             (pred_4 ))



(:action op_2
:parameters (?v7 ?v8 ?v4 ?v5)
:precondition (and (pred_8 ?v7) (pred_8 ?v8) (pred_11 ?v4) (pred_2 ?v5)
          (pred_5 ?v7 ?v8) (pred_3 ?v4 ?v5)
                   (pred_7 ?v8 ?v5) (pred_12 ?v7) 
                   (pred_1 ?v8) (pred_6 ?v4))
:effect (and  (pred_9 ?v8) (not (pred_1 ?v8))))


(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_8 ?v7) (pred_8 ?v3)
               (pred_12 ?v7) (pred_5 ?v7 ?v3) (pred_9 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_11 ?v4) 
                  (pred_12 ?v7) (pred_10 ?v4 ?v7) (pred_4 ))
:effect (and (pred_6 ?v4)
   (not (pred_10 ?v4 ?v7)) (not (pred_4 ))))


(:action op_3
:parameters (?v7 ?v11 ?v2)
:precondition (and (pred_8 ?v7) (pred_11 ?v11) (pred_11 ?v2)
                  (pred_12 ?v7) (pred_6 ?v2) (pred_10 ?v11 ?v7))
:effect (and (pred_6 ?v11) (pred_10 ?v2 ?v7)
        (not (pred_6 ?v2)) (not (pred_10 ?v11 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_8 ?v7) (pred_11 ?v4) 
                  (pred_12 ?v7) (pred_6 ?v4))
:effect (and (pred_4 ) (pred_10 ?v4 ?v7) (not (pred_6 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_05 obj_09 obj_06 obj_11 obj_02 obj_04 obj_08 obj_03
    obj_12 obj_10
    obj_13 obj_07
    )

    (:init
       (pred_4)

       (pred_8 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_10)
       (pred_11 obj_13)
       (pred_11 obj_07)

       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_05 obj_09)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_09 obj_02)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_02)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_09)
       (pred_5 obj_02 obj_11)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_06)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_03)
       (pred_7  obj_04 obj_12)
       (pred_7  obj_03 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_08)

       (pred_3  obj_13 obj_12)
       (pred_3  obj_07 obj_10)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_07 obj_04)
       (pred_12 obj_01)
    )

    (:goal (and
       (pred_10 obj_13 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_05)))
)
)

; plan
1. (op_4 obj_01 obj_13)
   deleted: (pred_10 obj_13 obj_01) (pred_4)
   added: (pred_6 obj_13)
   goals met: 0 of 1
2. (op_5 obj_01 obj_06)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_06)
   goals met: 0 of 1
3. (op_5 obj_06 obj_11)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_02)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_09)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_4) (pred_10 obj_13 obj_09)
   goals met: 1 of 1
